# This is a sample Jupyter Notebook

Below is an example of a code cell. 
Put your cursor into the cell and press Shift+Enter to execute it and select the next one, or click 'Run Cell' button.

Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.

To learn more about Jupyter Notebooks in PyCharm, see [help](https://www.jetbrains.com/help/pycharm/ipython-notebook-support.html).
For an overview of PyCharm, go to Help -> Learn IDE features or refer to [our documentation](https://www.jetbrains.com/help/pycharm/getting-started.html).

**we have pandas for operating data in a very interesting way manipulating it**

#Key data structure in pandas
1D Series
2D DataFrame

In [8]:
import pandas as pd

In [11]:
labelled_array = pd.Series([1,2,3,4,5])

In [12]:
labelled_array

0    1
1    2
2    3
3    4
4    5
dtype: int64

* as we can see from the output of the above par5t it just displayed my list in the labelled array form but we might be confused why not use array because here we can use array and index them by using our own name a["apple"] instead of standard rule of a[9]

* lets change the index as jk suga jimin rm v

In [20]:
labelled_array = pd.Series([1,2,3,4,5], index=['ram','suga','jimin','jk','v'])

In [21]:
labelled_array

ram      1
suga     2
jimin    3
jk       4
v        5
dtype: int64

In [26]:
df = pd.DataFrame({"name": ["ram","shyam","hari"],"age":[1,2,3]})
df

    name  age
0    ram    1
1  shyam    2
2   hari    3

In [39]:
df = pd.read_csv("data/ex.csv",encoding='latin1')
df

,description,industry,level,size,line_code,value,Unit,Footnotes
0,Total number of businesses,total,0,619 employees,NaN,35562,Number of businesses,1 and 2 and 3 and 4 and 6
1,Total number of businesses,total,0,2049 employees,NaN,8796,Number of businesses,1 and 2 and 3 and 4 and 6
2,Total number of businesses,total,0,5099 employees,NaN,2529,Number of businesses,1 and 2 and 3 and 4 and 6
3,Total number of businesses,total,0,100+ employees,NaN,2100,Number of businesses,1 and 2 and 3 and 4 and 6
4,Total number of businesses,"Agriculture, forestry, & fishing",1,total,NaN,3756,Number of businesses,1 and 2 and 3 and 6
...,...,...,...,...,...,...,...,...
17902,Measures in place to reduce its environmental ...,Education & training,1,total,C4200.02,636,Number of businesses,1 and 2 and 3 and 6
17903,Measures in place to reduce its environmental ...,Health care & social assistance,1,total,C4200.02,1581,Number of businesses,1 and 2 and 3 and 6
17904,Measures in place to reduce its environmental ...,Arts & recreation services,1,total,C4200.02,390,Number of businesses,1 and 2 and 3 and 6
17905,Measures in place to reduce its environmental ...,Other services,1,total,C4200.02,732,Number of businesses,1 and 2 and 3 and 6
17906,Measures in place to reduce its environmental ...,total,0,total,C4200.02,26589,Number of businesses,1 and 2 and 3 and 6